# Import Libraries

In [1]:
import pandas as pd
import numpy as np

# Load Data

The I used for this project is managed by the National Center for Health Statistics (NCHS) and the Bureau of Labor Statistics (BLS). The table below displays the sources, datasets, and columns in the data.

<img src="../images/raw_data_summary.png">

Each dataset was loaded from a csv file (stored in the raw_data directory) into a dataframe. Then, the columns were renamed, and dates were converted to date_time. The new column names are displayd in the table below.

<img src="../images/column_names.png">

As a sanity check, I displayed the record for the minimum and maximum of each column in every dataframe. The figure below displays a summary of the process I used to load the data.


<img src="../images/load_data_process.png">

### Unemployment Data

[Here](https://fred.stlouisfed.org/series/UNRATE/) is the link to the CSV file for the BLS Unemployment data.

In [2]:
# Load unemployement data into DataFrame (unemployement_df)
unemployment_df = pd.read_csv('../raw_data/UNRATE.csv')

# Rename columns
unemployment_df.rename({
    'DATE': 'date',
    'UNRATE': 'unemployment_rate'
}, axis='columns', inplace=True)

# Convert date from string to datetime
unemployment_df['date'] = pd.to_datetime(unemployment_df['date'])

In [3]:
# Display info
unemployment_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 851 entries, 0 to 850
Data columns (total 2 columns):
date                 851 non-null datetime64[ns]
unemployment_rate    851 non-null float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 13.4 KB

In [4]:
# Display top 5 rows
unemployment_df.head()

        date  unemployment_rate
0 1948-01-01                3.4
1 1948-02-01                3.8
2 1948-03-01                4.0
3 1948-04-01                3.9
4 1948-05-01                3.5

In [5]:
# Display date range
print('Start Date:', unemployment_df.iloc[0].values)
print('End Date  :', unemployment_df.iloc[-1].values)

Start Date: [Timestamp('1948-01-01 00:00:00') 3.4]
End Date  : [Timestamp('2018-11-01 00:00:00') 3.7]

In [6]:
# Display unemployment_rate range
print('Lowest Unemployment :', unemployment_df.iloc[unemployment_df['unemployment_rate'].idxmin()].values)
print('Highest Unemployment:', unemployment_df.iloc[unemployment_df['unemployment_rate'].idxmax()].values)

Lowest Unemployment : [Timestamp('1953-05-01 00:00:00') 2.5]
Highest Unemployment: [Timestamp('1982-11-01 00:00:00') 10.8]

### Birth Data

[Here](https://data.cdc.gov/NCHS/NCHS-Births-and-General-Fertility-Rates-United-Sta/e6fc-ccez) is the link to the CSV file for the NCHS Birth data.

In [7]:
# Load birth data into DataFrame
birth_df = pd.read_csv('../raw_data/NCHS_-_Births_and_General_Fertility_Rates__United_States.csv')

# Rename columns
birth_df.rename({
    'Year': 'year',
    'Birth Number': 'number_of_births',
    'General Fertility Rate': 'general_fertility_rate',
    'Crude Birth Rate': 'crude_birth_rate',
}, axis='columns', inplace=True)

# Convert year from string to datetime
birth_df['year'] = pd.to_datetime(birth_df['year'], format='%Y').dt.year

In [8]:
# Display info
birth_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 4 columns):
year                      107 non-null int64
number_of_births          107 non-null int64
general_fertility_rate    107 non-null float64
crude_birth_rate          107 non-null float64
dtypes: float64(2), int64(2)
memory usage: 3.4 KB

In [9]:
# Display top 5 rows
birth_df.head()

   year  number_of_births  general_fertility_rate  crude_birth_rate
0  2015           3978497                    62.5              12.4
1  2014           3988076                    62.9              12.5
2  2013           3932181                    62.5              12.4
3  2012           3952841                    63.0              12.6
4  2011           3953590                    63.2              12.7

In [10]:
# Display date range
print('Start Date:', birth_df.iloc[-1].values)
print('End Date  :', birth_df.iloc[0].values)

Start Date: [1.909e+03 2.718e+06 1.268e+02 3.000e+01]
End Date  : [2.015000e+03 3.978497e+06 6.250000e+01 1.240000e+01]

In [11]:
# Display number_of_births range
print('Lowest Number of Births :', birth_df.iloc[birth_df['number_of_births'].idxmin()].values)
print('Highest Number of Births:', birth_df.iloc[birth_df['number_of_births'].idxmax()].values)

Lowest Number of Births : [1.933e+03 2.307e+06 7.630e+01 1.840e+01]
Highest Number of Births: [2.007000e+03 4.316233e+06 6.930000e+01 1.430000e+01]

In [12]:
# Display general_fertility_rate range
print('Lowest General Fertility Rate :', birth_df.iloc[birth_df['general_fertility_rate'].idxmin()].values)
print('Highest General Fertility Rate:', birth_df.iloc[birth_df['general_fertility_rate'].idxmax()].values)

Lowest General Fertility Rate : [2.015000e+03 3.978497e+06 6.250000e+01 1.240000e+01]
Highest General Fertility Rate: [1.910e+03 2.777e+06 1.268e+02 3.010e+01]

In [13]:
# Display crude_birth_rate range
print('Lowest Crude Birth Rate :', birth_df.iloc[birth_df['crude_birth_rate'].idxmin()].values)
print('Highest Crude Birth Rate:', birth_df.iloc[birth_df['crude_birth_rate'].idxmax()].values)

Lowest Crude Birth Rate : [2.015000e+03 3.978497e+06 6.250000e+01 1.240000e+01]
Highest Crude Birth Rate: [1.910e+03 2.777e+06 1.268e+02 3.010e+01]

### Childhood Mortality Data

[Here](https://catalog.data.gov/dataset/childhood-mortality-rates-by-age-at-death-united-states-1900-2013 ) is the link to the CSV file for the NCHS Birth data.

In [14]:
# Load childhood mortality data into DataFrame (mortality_df)
mortality_df = pd.read_csv('../raw_data/NCHS_-_Childhood_Mortality_Rates.csv')

# Rename columns
mortality_df.rename({
    'Year': 'year',
    'Age Group': 'age_group',
    'Death Rate': 'death_rate'
}, axis='columns', inplace=True)

# Convert year from string to datetime
mortality_df['year'] = pd.to_datetime(mortality_df['year'], format='%Y').dt.year

In [15]:
# Display info
mortality_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 464 entries, 0 to 463
Data columns (total 3 columns):
year          464 non-null int64
age_group     464 non-null object
death_rate    464 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.0+ KB

In [16]:
# Display top 5 rows
mortality_df.head()

   year    age_group  death_rate
0  1900  10-14 years       298.3
1  1900    1-4 years      1983.8
2  1900  15-19 years       484.8
3  1900    5-9 years       466.1
4  1901  10-14 years       273.6

In [17]:
# Display date range
print('Start Date:', mortality_df.iloc[0].values)
print('End Date  :', mortality_df.iloc[-1].values)

Start Date: [1900 '10-14 years' 298.3]
End Date  : [2015 '5-9 years' 11.7]

In [18]:
# Display mortality range
print('Lowest death_rate :\n', mortality_df.iloc[mortality_df['death_rate'].idxmin()])
print('\nHighest death_rate:\n', mortality_df.iloc[mortality_df['death_rate'].idxmax()])

Lowest death_rate :
 year               2012
age_group     5-9 years
death_rate         11.4
Name: 451, dtype: object

Highest death_rate:
 year               1900
age_group     1-4 years
death_rate       1983.8
Name: 1, dtype: object

# Wrangle Data

The goal is to wrangle the dataframes into a single [tidy](https://cran.r-project.org/web/packages/tidyr/vignettes/tidy-data.html) dataframe. The figure below illustrates the process.

<img src="../images/wrangle_data_process.png">

Here are more information about [spreading](https://d33wubrfki0l68.cloudfront.net/3aea19108d39606bbe49981acda07696c0c7fcd8/2de65/images/tidy-9.png) and [aggregating](https://news.codecademy.com/aggregating-pokemon-data-python-pandas/) data.

### Aggregate unemployment date by year

In [19]:
# Aggregate data based on yearly average
tidy_unemployment_df = unemployment_df.groupby([unemployment_df['date'].dt.year]).mean().reset_index()
tidy_unemployment_df.rename({
    'date': 'year', 
    'unemployment_rate': 'average_unemployment_rate'
}, axis='columns', inplace=True)

In [20]:
# Display head of aggregated unemployement data
tidy_unemployment_df.head()

   year  average_unemployment_rate
0  1948                   3.750000
1  1949                   6.050000
2  1950                   5.208333
3  1951                   3.283333
4  1952                   3.025000

### Spread mortality_df based on age_group

In [21]:
# Spread mortality_df based on age_group
tidy_mortality_df = mortality_df.pivot(index='year',columns='age_group',values='death_rate').reset_index()
tidy_mortality_df.rename({
    '1-4 years': '1_4_years',
    '5-9 years': '5_9_years',
    '10-14 years': '10_14_years',
    '15-19 years': '15_19_years',
}, axis='columns', inplace=True)

In [22]:
# Display head of mortality data
tidy_mortality_df.head()

age_group  year  1_4_years  10_14_years  15_19_years  5_9_years
0          1900     1983.8        298.3        484.8      466.1
1          1901     1695.0        273.6        454.4      427.6
2          1902     1655.7        252.5        421.5      403.3
3          1903     1542.1        268.2        434.1      414.7
4          1904     1591.5        305.2        471.4      425.0

### Join unemployement data, mortality data, and birth data by year

In [23]:
# Join unemployement data and birth data by year
tidy_warehouse_df = tidy_unemployment_df.merge(right=birth_df, on='year', how='inner')

# Join mortality dataand other data by year
tidy_warehouse_df = tidy_mortality_df.merge(right=tidy_warehouse_df, on='year', how='inner')

In [24]:
# Display info
tidy_warehouse_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 68 entries, 0 to 67
Data columns (total 9 columns):
year                         68 non-null int64
1_4_years                    68 non-null float64
10_14_years                  68 non-null float64
15_19_years                  68 non-null float64
5_9_years                    68 non-null float64
average_unemployment_rate    68 non-null float64
number_of_births             68 non-null int64
general_fertility_rate       68 non-null float64
crude_birth_rate             68 non-null float64
dtypes: float64(7), int64(2)
memory usage: 5.3 KB

In [25]:
# Display top 5 rows
tidy_warehouse_df.head()

,year,1_4_years,10_14_years,15_19_years,5_9_years,average_unemployment_rate,number_of_births,general_fertility_rate,crude_birth_rate
0,1948,160.1,65.6,118.7,70.6,3.750000,3637000,107.3,24.9
1,1949,150.2,63.6,111.8,68.2,6.050000,3649000,107.1,24.5
2,1950,139.4,58.1,108.6,61.7,5.208333,3632000,106.2,24.1
3,1951,136.9,56.4,108.9,61.7,3.283333,3820000,111.5,24.9
4,1952,141.1,56.8,114.4,61.3,3.025000,3909000,113.9,25.1

# Save Data Warehouse

The merged tidy dataframe (tidy_warehouse_df) will be saved to the tidy_data folder.

In [26]:
tidy_warehouse_df.to_csv('../tidy_data/tidy_warehouse.csv', index=False)